app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" ORDER BY "authors"."last_name" ASC
---
  def index
    @authors = Author.order(:last_name)