app/controllers/cases_controller.rb

    def set_case
      @case = Case.find(params[:id])
---
SELECT  "cases".* FROM "cases" WHERE "cases"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]