app/controllers/case_controller.rb

SELECT "cases".* FROM "cases" ORDER BY "cases"."title" ASC
---
  def index
    @cases = Case.order (:title)